0/air/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    empty1
    {
        type            empty;
    }
    air_top
    {
        type            symmetryPlane;
        value           uniform 300;
    }
    airinlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    airoutlet
    {
        type            zeroGradient;
        value           uniform 300;
    }
    air_to_solid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappa           fluidThermo;
        kappaName       none;
    }
}


// ************************************************************************* //
