0/air/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    empty1
    {
        type            empty;
    }
    air_top
    {
        type            symmetryPlane;
        value           uniform 0.1;
    }
    airinlet
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    airoutlet
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    air_to_solid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
